In [21]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [22]:
from getpass import getpass

password = getpass()

In [23]:
conn_str = "mysql+pymysql://root:{}@localhost:3306/ClassicModels".format(password)

In [25]:
%sql $conn_str

In [35]:
%sql SELECT DISTINCT Country FROM Customers;

 * mysql+pymysql://root:***@localhost:3306/ClassicModels
27 rows affected.

[('France',),
 ('USA',),
 ('Australia',),
 ('Norway',),
 ('Poland',),
 ('Germany',),
 ('Spain',),
 ('Sweden',),
 ('Denmark',),
 ('Singapore',),
 ('Portugal',),
 ('Japan',),
 ('Finland',),
 ('UK',),
 ('Ireland',),
 ('Canada',),
 ('Hong Kong',),
 ('Italy',),
 ('Switzerland',),
 ('Netherlands',),
 ('Belgium',),
 ('New Zealand',),
 ('South Africa',),
 ('Austria',),
 ('Philippines',),
 ('Russia',),
 ('Israel',)]

In [39]:
%%sql 
SELECT * FROM customers WHERE customerNumber in 
(SELECT DISTINCT customerNumber FROM payments WHERE paymentDate<"2004-10-28")
limit 10;

 * mysql+pymysql://root:***@localhost:3306/ClassicModels
10 rows affected.

[(103, 'Atelier graphique', 'Schmitt', 'Carine ', '40.32.2555', '54, rue Royale', None, 'Nantes', None, '44000', 'France', 1370, 21000.0, b'\xe6\x10\x00\x00\x01\x01\x00\x00\x00]\xa5\xbb\xebl\xe8\xf8\xbfm1\xe4}\xc1\x9bG@'),
 (112, 'Signal Gift Stores', 'King', 'Jean', '7025551838', '8489 Strong St.', None, 'Las Vegas', 'NV', '83030', 'USA', 1166, 71800.0, b'\xe6\x10\x00\x00\x01\x01\x00\x00\x00o\x0e\xd7j\x0f\xcb\\\xc0\x01OZ\xb8\xac\x0eB@'),
 (114, 'Australian Collectors, Co.', 'Ferguson', 'Peter', '03 9520 4555', '636 St Kilda Road', 'Level 3', 'Melbourne', 'Victoria', '3004', 'Australia', 1611, 117300.0, b'\xe6\x10\x00\x00\x01\x01\x00\x00\x00\xe3\x16\x98\xba\xd0\x1eb@\x8f\x84"\x82\x16\xe8B\xc0'),
 (119, 'La Rochelle Gifts', 'Labrune', 'Janine ', '40.67.8555', '67, rue des Cinquante Otages', None, 'Nantes', None, '44000', 'France', 1370, 118200.0, b'\xe6\x10\x00\x00\x01\x01\x00\x00\x00]\xa5\xbb\xebl\xe8\xf8\xbfm1\xe4}\xc1\x9bG@'),
 (121, 'Baane Mini Imports', 'Bergulfsen', 'Jonas ', '07-98 9555', 'Erling Skakkes gate 78', None, 'Stavern', None, '4110', 'Norway', 1504, 81700.0, b"\xe6\x10\x00\x00\x01\x01\x00\x00\x00\x12\xd4\x95t9\x12$@dB'\xdf\xc7\x7fM@"),
 (124, 'Mini Gifts Distributors Ltd.', 'Nelson', 'Susan', '4155551450', '5677 Strong St.', None, 'San Rafael', 'CA', '97562', 'USA', 1165, 210500.0, b'\xe6\x10\x00\x00\x01\x01\x00\x00\x00U\x94\x01V\xfd\xa1^\xc0!C"\xc8\x9c\xfcB@'),
 (128, 'Blauer See Auto, Co.', 'Keitel', 'Roland', '+49 69 66 90 2555', 'Lyonerstr. 34', None, 'Frankfurt', None, '60528', 'Germany', 1504, 59700.0, b'\xe6\x10\x00\x00\x01\x01\x00\x00\x00Xx\xf2Dk\\!@\x1e\x0f\xc7\x04F\x0eI@'),
 (129, 'Mini Wheels Co.', 'Murphy', 'Julie', '6505555787', '5557 North Pendale Street', None, 'San Francisco', 'CA', '94217', 'USA', 1165, 64600.0, b'\xe6\x10\x00\x00\x01\x01\x00\x00\x00B^\x0f&\xc5\x9d^\xc0R\x9a\xcd\xe30\xe3B@'),
 (131, 'Land of Toys Inc.', 'Lee', 'Kwai', '2125557818', '897 Long Airport Avenue', None, 'NYC', 'NY', '10022', 'USA', 1323, 114900.0, b'\xe6\x10\x00\x00\x01\x01\x00\x00\x00\xf8I\xff\xdca\x80R\xc0,\xe7\x9c\xe9o[D@'),
 (141, 'Euro+ Shopping Channel', 'Freyre', 'Diego ', '(91) 555 94 44', 'C/ Moralzarzal, 86', None, 'Madrid', None, '28034', 'Spain', 1370, 227600.0, b'\xe6\x10\x00\x00\x01\x01\x00\x00\x00x;g\xb0N\x9a\r\xc09\x05\x9e V5D@')]

In [40]:
%%sql
SELECT customerNumber, COUNT(*) as totalPayments
FROM payments WHERE paymentDate<"2004-10-28" GROUP BY customerNumber
limit 10;

 * mysql+pymysql://root:***@localhost:3306/ClassicModels
10 rows affected.

[(103, 2),
 (112, 2),
 (114, 3),
 (119, 1),
 (121, 2),
 (124, 5),
 (128, 3),
 (129, 2),
 (131, 2),
 (141, 8)]

In [43]:
%%sql
SELECT customerNumber, SUM(amount) as totalPayment
    FROM payments WHERE paymentDate<"2004-10-28"
    GROUP BY customerNumber
    limit 10;

 * mysql+pymysql://root:***@localhost:3306/ClassicModels
10 rows affected.

[(103, 20638.22),
 (112, 65989.86),
 (114, 98323.85),
 (119, 47924.19),
 (121, 51710.329999999994),
 (124, 296563.25),
 (128, 68471.44),
 (129, 40461.78),
 (131, 57614.59),
 (141, 331256.87999999995)]

In [46]:
%%sql
SELECT customerNumber,
    COUNT(*) as numberOfPayments,
    SUM(amount) as totalPayment
    FROM payments
    WHERE paymentDate<"2004-10-28"
    GROUP BY customerNumber
    limit 10;

 * mysql+pymysql://root:***@localhost:3306/ClassicModels
10 rows affected.

[(103, 2, 20638.22),
 (112, 2, 65989.86),
 (114, 3, 98323.85),
 (119, 1, 47924.19),
 (121, 2, 51710.329999999994),
 (124, 5, 296563.25),
 (128, 3, 68471.44),
 (129, 2, 40461.78),
 (131, 2, 57614.59),
 (141, 8, 331256.87999999995)]

In [48]:
%%sql
SELECT customerNumber, SUM(amount) as totalPayment
	FROM payments
    WHERE paymentDate<"2004-10-28"
    GROUP BY customerNumber
    ORDER BY totalPayment DESC
    LIMIT 10
    OFFSET 10;

 * mysql+pymysql://root:***@localhost:3306/ClassicModels
10 rows affected.

[(386, 90143.31),
 (278, 89875.6),
 (161, 89418.78),
 (145, 86881.64),
 (321, 85559.12),
 (249, 82223.23),
 (239, 80375.24),
 (276, 80101.92000000001),
 (458, 79294.53),
 (406, 74246.12)]

In [49]:
%%sql
SELECT customerName,
	CONCAT(UCASE(contactFirstName), " ", UCASE(contactLastName)) AS contact,
    phone
    FROM customers
    WHERE country="USA"
    ORDER BY customerName;

 * mysql+pymysql://root:***@localhost:3306/ClassicModels
36 rows affected.

[('American Souvenirs Inc', 'KEITH FRANCO', '2035557845'),
 ('Auto-Moto Classics Inc.', 'LESLIE TAYLOR', '6175558428'),
 ('Boards & Toys Co.', 'MARY YOUNG', '3105552373'),
 ('Cambridge Collectables Co.', 'JERRY TSENG', '6175555555'),
 ('Classic Gift Ideas, Inc', 'FRANCISCA CERVANTES', '2155554695'),
 ('Classic Legends Inc.', 'MARIA HERNANDEZ', '2125558493'),
 ('Collectable Mini Designs Co.', 'VALARIE THOMPSON', '7605558146'),
 ('Collectables For Less Inc.', 'ALLEN NELSON', '6175558555'),
 ('Corporate Gift Ideas Co.', 'JULIE BROWN', '6505551386'),
 ('Diecast Classics Inc.', 'KELVIN LEONG', '2155551555'),
 ('Diecast Collectables', 'VALARIE FRANCO', '6175552555'),
 ('FunGiftIdeas.com', 'VIOLETA BENITEZ', '5085552555'),
 ('Gift Depot Inc.', 'JULIE KING', '2035552570'),
 ('Gift Ideas Corp.', 'DAN LEWIS', '2035554407'),
 ('Gifts4AllAges.com', 'JURI YOSHIDO', '6175559555'),
 ('Land of Toys Inc.', 'KWAI LEE', '2125557818'),
 ("Marta's Replicas Co.", 'MARTA HERNANDEZ', '6175558555'),
 ("Men 'R' US Retailers, Ltd.", 'BRIAN CHANDLER', '2155554369'),
 ('Microscale Inc.', 'YU CHOI', '2125551957'),
 ('Mini Classics', 'STEVE FRICK', '9145554562'),
 ('Mini Creations Ltd.', 'WING HUANG', '5085559555'),
 ('Mini Gifts Distributors Ltd.', 'SUSAN NELSON', '4155551450'),
 ('Mini Wheels Co.', 'JULIE MURPHY', '6505555787'),
 ('Motor Mint Distributors Inc.', 'ROSA SALAZAR', '2155559857'),
 ('Muscle Machine Inc', 'JEFF YOUNG', '2125557413'),
 ('Online Diecast Creations Co.', 'DOROTHY YOUNG', '6035558647'),
 ('Online Mini Collectables', 'MIGUEL BARAJAS', '6175557555'),
 ('Signal Collectibles Ltd.', 'SUE TAYLOR', '4155554312'),
 ('Signal Gift Stores', 'JEAN KING', '7025551838'),
 ('Super Scale Inc.', 'LESLIE MURPHY', '2035559545'),
 ('Technics Stores Inc.', 'JURI HASHIMOTO', '6505556809'),
 ('Tekni Collectables Inc.', 'WILLIAM BROWN', '2015559350'),
 ('The Sharp Gifts Warehouse', 'SUE FRICK', '4085553659'),
 ('Toys4GrownUps.com', 'JULIE YOUNG', '6265557265'),
 ('Vitachrome Inc.', 'MICHAEL FRICK', '2125551500'),
 ('West Coast Collectables Co.', 'STEVE THOMPSON', '3105553722')]

In [52]:
%%sql
select customerName,
	LCASE(SUBSTRING(country, 1, 3))
    AS countryCode
    FROM customers ORDER BY customerName
    LIMIT 10;

 * mysql+pymysql://root:***@localhost:3306/ClassicModels
10 rows affected.

[('Alpha Cognac', 'fra'),
 ('American Souvenirs Inc', 'usa'),
 ('Amica Models & Co.', 'ita'),
 ('ANG Resellers', 'spa'),
 ("Anna's Decorations, Ltd", 'aus'),
 ('Anton Designs, Ltd.', 'spa'),
 ('Asian Shopping Network, Co', 'sin'),
 ('Asian Treasures, Inc.', 'ire'),
 ('Atelier graphique', 'fra'),
 ('Australian Collectables, Ltd', 'aus')]

In [53]:
%%sql
select productName,
	ROUND(MSRP) AS salePrice
    FROM products
    WHERE productLine="Motorcycles"
    ORDER BY salePrice DESC
    LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/ClassicModels
5 rows affected.

[('2003 Harley-Davidson Eagle Drag Bike', 194.0),
 ('2002 Suzuki XREO', 151.0),
 ('1996 Moto Guzzi 1100i', 119.0),
 ('1997 BMW R 1100 S', 113.0),
 ('1974 Ducati 350 Mk3 Desmo', 102.0)]

In [54]:
%%sql
SELECT productCode,
	productName,
    buyPrice,
    MSRP,
    ROUND(((MSRP - buyPrice)*100/buyPrice), 2) AS profitMargin
    FROM products
    ORDER BY profitMargin DESC
    LIMIT 10;

 * mysql+pymysql://root:***@localhost:3306/ClassicModels
10 rows affected.

[('S24_4620', '1961 Chevrolet Impala', 32.33, 80.84, 150.05),
 ('S24_3420', '1937 Horch 930V Limousine', 26.3, 65.75, 150.0),
 ('S12_3990', '1970 Plymouth Hemi Cuda', 31.92, 79.8, 150.0),
 ('S18_2625', '1936 Harley Davidson El Knucklehead', 24.23, 60.57, 149.98),
 ('S18_2432', '1926 Ford Fire Engine', 24.92, 60.77, 143.86),
 ('S50_4713', '2002 Yamaha YZR M1', 34.17, 81.36, 138.1),
 ('S24_3949', 'Corsair F4U ( Bird Cage)', 29.34, 68.24, 132.58),
 ('S18_2795', '1928 Mercedes-Benz SSK', 72.56, 168.75, 132.57),
 ('S32_3207', "1950's Chicago Surface Lines Streetcar", 26.72, 62.14, 132.56),
 ('S18_2870', '1999 Indy 500 Monte Carlo SS', 56.76, 132.0, 132.56)]

In [56]:
%%sql
SELECT customerNumber,
	MAX(amount) AS largestPayment
    FROM payments
    WHERE YEAR(paymentDate)=2004
    GROUP BY customerNumber
    ORDER BY largestPayment DESC
    LIMIT 10;

 * mysql+pymysql://root:***@localhost:3306/ClassicModels
10 rows affected.

[(141, 116208.4),
 (124, 85410.87),
 (114, 82261.22),
 (239, 80375.24),
 (157, 63357.13),
 (298, 61402.0),
 (259, 61234.67),
 (450, 59551.38),
 (227, 53745.34),
 (256, 53116.99)]

In [58]:
%%sql
SELECT YEAR(paymentDate) as `year`,
	MONTH(paymentDate) as `month`,
	ROUND(SUM(amount), 2) as `totaPayments`
    FROM payments
    GROUP BY `year`, `month`
    ORDER BY `year`, `month`;

 * mysql+pymysql://root:***@localhost:3306/ClassicModels
30 rows affected.

[(2003, 1, 26267.62),
 (2003, 2, 144384.36),
 (2003, 3, 199704.48),
 (2003, 4, 136313.92),
 (2003, 5, 159881.97),
 (2003, 6, 180218.98),
 (2003, 7, 158247.0),
 (2003, 8, 246204.86),
 (2003, 9, 161206.23),
 (2003, 10, 316857.96),
 (2003, 11, 694292.68),
 (2003, 12, 826637.64),
 (2004, 1, 234152.13),
 (2004, 2, 106652.01),
 (2004, 3, 404603.21),
 (2004, 4, 173245.96),
 (2004, 5, 208524.42),
 (2004, 6, 185842.86),
 (2004, 7, 284191.48),
 (2004, 8, 378094.3),
 (2004, 9, 476445.53),
 (2004, 10, 185103.43),
 (2004, 11, 857187.3),
 (2004, 12, 819285.62),
 (2005, 1, 137468.06),
 (2005, 2, 252321.22),
 (2005, 3, 385268.09),
 (2005, 4, 183897.72),
 (2005, 5, 272248.93),
 (2005, 6, 59089.26)]

In [59]:
%%sql
SELECT YEAR(paymentDate) as `year`,
	DATE_FORMAT(paymentDate, "%b") AS `monthName`,
	CONCAT("$", FORMAT(SUM(amount), 2)) AS `totalPayments`
    FROM payments
    GROUP BY `year`, MONTH(paymentDate), `monthName`
    ORDER BY `year`, MONTH(paymentDate);

 * mysql+pymysql://root:***@localhost:3306/ClassicModels
30 rows affected.

[(2003, 'Jan', '$26,267.62'),
 (2003, 'Feb', '$144,384.36'),
 (2003, 'Mar', '$199,704.48'),
 (2003, 'Apr', '$136,313.92'),
 (2003, 'May', '$159,881.97'),
 (2003, 'Jun', '$180,218.98'),
 (2003, 'Jul', '$158,247.00'),
 (2003, 'Aug', '$246,204.86'),
 (2003, 'Sep', '$161,206.23'),
 (2003, 'Oct', '$316,857.96'),
 (2003, 'Nov', '$694,292.68'),
 (2003, 'Dec', '$826,637.64'),
 (2004, 'Jan', '$234,152.13'),
 (2004, 'Feb', '$106,652.01'),
 (2004, 'Mar', '$404,603.21'),
 (2004, 'Apr', '$173,245.96'),
 (2004, 'May', '$208,524.42'),
 (2004, 'Jun', '$185,842.86'),
 (2004, 'Jul', '$284,191.48'),
 (2004, 'Aug', '$378,094.30'),
 (2004, 'Sep', '$476,445.53'),
 (2004, 'Oct', '$185,103.43'),
 (2004, 'Nov', '$857,187.30'),
 (2004, 'Dec', '$819,285.62'),
 (2005, 'Jan', '$137,468.06'),
 (2005, 'Feb', '$252,321.22'),
 (2005, 'Mar', '$385,268.09'),
 (2005, 'Apr', '$183,897.72'),
 (2005, 'May', '$272,248.93'),
 (2005, 'Jun', '$59,089.26')]

## Combining Tables using Joins

A JOIN clause is used to combine rows from two or more tables, based on a related column between them. There are four types of joins: inner join, left (outer) join, right (outer) join, and (full) outer join.

Here's a visual explanation of different kinds of joins ([source](https://dataschool.com/how-to-teach-people-sql/sql-join-types-explained-visually/)):

<img src="https://i.imgur.com/m3IonpI.png" width="480">

# Inner Join
 Show the 10 most recent payments with customer details (name & phone no.)

In [92]:
%%sql
SELECT checkNumber, paymentDate, amount, customers.customerNumber, customerName, phone
	FROM payments JOIN customers
    ON payments.customerNumber=customers.customerNumber
    ORDER BY paymentDate DESC LIMIT 10;

 * mysql+pymysql://root:***@localhost:3306/ClassicModels
10 rows affected.

[('HJ618252', datetime.datetime(2005, 6, 9, 0, 0), 46656.94, 353, 'Reims Collectables', '26.47.1555'),
 ('HR224331', datetime.datetime(2005, 6, 3, 0, 0), 12432.32, 242, 'Alpha Cognac', '61.77.6555'),
 ('EU531600', datetime.datetime(2005, 5, 25, 0, 0), 30253.75, 496, "Kelly's Gift Shop", '+64 9 5555500'),
 ('AL493079', datetime.datetime(2005, 5, 23, 0, 0), 75020.13, 323, 'Down Under Souveniers, Inc', '+64 9 312 5555'),
 ('BOFA23232', datetime.datetime(2005, 5, 20, 0, 0), 29070.38, 233, 'Qu', '(514) 555-8054'),
 ('CITI3434344', datetime.datetime(2005, 5, 19, 0, 0), 28500.78, 175, 'Gift Depot Inc.', '2035552570'),
 ('DL460618', datetime.datetime(2005, 5, 19, 0, 0), 46895.48, 141, 'Euro+ Shopping Channel', '(91) 555 94 44'),
 ('JPMR4544', datetime.datetime(2005, 5, 18, 0, 0), 615.45, 398, 'Tokyo Collectables, Ltd', '+81 3 3584 0555'),
 ('EQ12267', datetime.datetime(2005, 5, 17, 0, 0), 17928.09, 250, 'Lyon Souveniers', '+33 1 46 62 7555'),
 ('BOAF82044', datetime.datetime(2005, 5, 3, 0, 0), 35157.75, 209, 'Mini Caravy', '88.60.1555')]

Show the full office address and phone number for each employee.

In [97]:
%%sql
SELECT employeeNumber, CONCAT(lastName," ", firstName) as employeeName, offices.country, offices.city, offices.addressLine1, offices.phone
    from employees JOIN offices
    ON employees.officeCode=offices.officeCode
    ORDER BY employeeNumber;

 * mysql+pymysql://root:***@localhost:3306/ClassicModels
23 rows affected.

[(1002, 'Murphy Diane', 'USA', 'San Francisco', '100 Market Street', '+1 650 219 4782'),
 (1056, 'Patterson Mary', 'USA', 'San Francisco', '100 Market Street', '+1 650 219 4782'),
 (1076, 'Firrelli Jeff', 'USA', 'San Francisco', '100 Market Street', '+1 650 219 4782'),
 (1088, 'Patterson William', 'Australia', 'Sydney', '5-11 Wentworth Avenue', '+61 2 9264 2451'),
 (1102, 'Bondur Gerard', 'France', 'Paris', "43 Rue Jouffroy D'abbans", '+33 14 723 4404'),
 (1143, 'Bow Anthony', 'USA', 'San Francisco', '100 Market Street', '+1 650 219 4782'),
 (1165, 'Jennings Leslie', 'USA', 'San Francisco', '100 Market Street', '+1 650 219 4782'),
 (1166, 'Thompson Leslie', 'USA', 'San Francisco', '100 Market Street', '+1 650 219 4782'),
 (1188, 'Firrelli Julie', 'USA', 'Boston', '1550 Court Place', '+1 215 837 0825'),
 (1216, 'Patterson Steve', 'USA', 'Boston', '1550 Court Place', '+1 215 837 0825'),
 (1286, 'Tseng Foon Yue', 'USA', 'NYC', '523 East 53rd Street', '+1 212 555 3000'),
 (1323, 'Vanauf George', 'USA', 'NYC', '523 East 53rd Street', '+1 212 555 3000'),
 (1337, 'Bondur Loui', 'France', 'Paris', "43 Rue Jouffroy D'abbans", '+33 14 723 4404'),
 (1370, 'Hernandez Gerard', 'France', 'Paris', "43 Rue Jouffroy D'abbans", '+33 14 723 4404'),
 (1401, 'Castillo Pamela', 'France', 'Paris', "43 Rue Jouffroy D'abbans", '+33 14 723 4404'),
 (1501, 'Bott Larry', 'UK', 'London', '25 Old Broad Street', '+44 20 7877 2041'),
 (1504, 'Jones Barry', 'UK', 'London', '25 Old Broad Street', '+44 20 7877 2041'),
 (1611, 'Fixter Andy', 'Australia', 'Sydney', '5-11 Wentworth Avenue', '+61 2 9264 2451'),
 (1612, 'Marsh Peter', 'Australia', 'Sydney', '5-11 Wentworth Avenue', '+61 2 9264 2451'),
 (1619, 'King Tom', 'Australia', 'Sydney', '5-11 Wentworth Avenue', '+61 2 9264 2451'),
 (1621, 'Nishi Mami', 'Japan', 'Tokyo', '4-1 Kioicho', '+81 33 224 5000'),
 (1625, 'Kato Yoshimi', 'Japan', 'Tokyo', '4-1 Kioicho', '+81 33 224 5000'),
 (1702, 'Gerard Martin', 'France', 'Paris', "43 Rue Jouffroy D'abbans", '+33 14 723 4404')]

Show the full order information and product details for order no. 10100.

In [103]:
%%sql
SELECT orderNumber, quantityOrdered, priceEach, products.productName, products.msrp, products.productLine
    FROM orderdetails JOIN products
    ON orderdetails.productCode=products.productCode
    WHERE orderNumber=10100;

 * mysql+pymysql://root:***@localhost:3306/ClassicModels
4 rows affected.

[(10100, 30, 136.0, '1917 Grand Touring Sedan', 170.0, 'Vintage Cars'),
 (10100, 50, 55.09, '1911 Ford Town Car', 60.54, 'Vintage Cars'),
 (10100, 22, 75.46, '1932 Alfa Romeo 8C2300 Spider Sport', 92.03, 'Vintage Cars'),
 (10100, 49, 35.29, '1936 Mercedes Benz 500k Roadster', 41.03, 'Vintage Cars')]

### Self Join

A table can also be joined with itself. Each instance of the table can be given a temporary alias.<br>
Show a list of employees with the name & employee number of their manager.

In [104]:
%%sql
select E.employeeNumber,
	E.firstName,
    E.lastName,
    M.employeeNumber as managerEmployeeNumber,
    CONCAT(M.firstName, " ", M.lastName) as managerName
    from employees E LEFT JOIN employees M
    ON E.reportsTo=M.employeeNumber;

 * mysql+pymysql://root:***@localhost:3306/ClassicModels
23 rows affected.

[(1002, 'Diane', 'Murphy', None, None),
 (1056, 'Mary', 'Patterson', 1002, 'Diane Murphy'),
 (1076, 'Jeff', 'Firrelli', 1002, 'Diane Murphy'),
 (1088, 'William', 'Patterson', 1056, 'Mary Patterson'),
 (1102, 'Gerard', 'Bondur', 1056, 'Mary Patterson'),
 (1143, 'Anthony', 'Bow', 1056, 'Mary Patterson'),
 (1165, 'Leslie', 'Jennings', 1143, 'Anthony Bow'),
 (1166, 'Leslie', 'Thompson', 1143, 'Anthony Bow'),
 (1188, 'Julie', 'Firrelli', 1143, 'Anthony Bow'),
 (1216, 'Steve', 'Patterson', 1143, 'Anthony Bow'),
 (1286, 'Foon Yue', 'Tseng', 1143, 'Anthony Bow'),
 (1323, 'George', 'Vanauf', 1143, 'Anthony Bow'),
 (1337, 'Loui', 'Bondur', 1102, 'Gerard Bondur'),
 (1370, 'Gerard', 'Hernandez', 1102, 'Gerard Bondur'),
 (1401, 'Pamela', 'Castillo', 1102, 'Gerard Bondur'),
 (1501, 'Larry', 'Bott', 1102, 'Gerard Bondur'),
 (1504, 'Barry', 'Jones', 1102, 'Gerard Bondur'),
 (1611, 'Andy', 'Fixter', 1088, 'William Patterson'),
 (1612, 'Peter', 'Marsh', 1088, 'William Patterson'),
 (1619, 'Tom', 'King', 1088, 'William Patterson'),
 (1621, 'Mami', 'Nishi', 1056, 'Mary Patterson'),
 (1625, 'Yoshimi', 'Kato', 1621, 'Mami Nishi'),
 (1702, 'Martin', 'Gerard', 1102, 'Gerard Bondur')]

**EXERCISES**: Try the following exercises to become familiar with SQL joins:

1. Report the account representative for each customer.
2. Report total payments for Atelier graphique.
3. Report the total payments by date
4. Report the products that have not been sold.
5. List the amount paid by each customer.
6. How many orders have been placed by Herkku Gifts?
6. Who are the employees in Boston?
7. Report those payments greater than \\$100,000. Sort the report so the customer who made the highest payment appears first.
8. List the value of 'On Hold' orders.
9. Report the number of orders 'On Hold' for each customer.
10. List products sold by order date.
11. List the order dates in descending order for orders for the 1940 Ford Pickup Truck.
12. List the names of customers and their corresponding order number where a particular order from that customer has a value greater than $25,000?
14. Are there any products that appear on all orders?
15. List the names of products sold at less than 80% of the MSRP.
16. Reports those products that have been sold with a markup of 100% or more (i.e.,  the priceEach is at least twice the buyPrice)
17. List the products ordered on a Monday.
18. What is the quantity on hand for products listed on 'On Hold' orders?

**NOTE**: Not all of the above may necessarily require joins, and it may be possible to solve some of the above questions without join.

You can find the solutions for these questions here: https://github.com/harsha547/ClassicModels-Database-Queries

1. Report the account representative for each customer.

In [111]:
%%sql
SELECT customerName,
    CONCAT(employees.firstName, " ", employees.lastName) as representativeName,
    employees.officeCode
    from customers JOIN employees
    ON customers.salesRepEmployeeNumber=employees.employeeNumber
    Limit 10;

 * mysql+pymysql://root:***@localhost:3306/ClassicModels
10 rows affected.

[('Atelier graphique', 'Gerard Hernandez', '4'),
 ('Signal Gift Stores', 'Leslie Thompson', '1'),
 ('Australian Collectors, Co.', 'Andy Fixter', '6'),
 ('La Rochelle Gifts', 'Gerard Hernandez', '4'),
 ('Baane Mini Imports', 'Barry Jones', '7'),
 ('Mini Gifts Distributors Ltd.', 'Leslie Jennings', '1'),
 ('Blauer See Auto, Co.', 'Barry Jones', '7'),
 ('Mini Wheels Co.', 'Leslie Jennings', '1'),
 ('Land of Toys Inc.', 'George Vanauf', '3'),
 ('Euro+ Shopping Channel', 'Gerard Hernandez', '4')]

2. Report total payments for Atelier graphique.

In [114]:
%%sql
SELECT customerName,
    SUM(payments.amount) as totalPayments,
    COUNT(payments.amount) as numberOfPayments
    FROM customers JOIN payments
    ON customers.customerNumber=payments.customerNumber
    WHERE customers.CustomerName="Atelier graphique";

 * mysql+pymysql://root:***@localhost:3306/ClassicModels
1 rows affected.

[('Atelier graphique', 22314.36, 3)]

3. Report the total payments by date

In [133]:
%%sql

SELECT DATE(paymentdate) as Date, SUM(amount) AS totalPayments
    FROM payments
    GROUP BY Date ORDER BY Date
    LIMIT 10;

 * mysql+pymysql://root:***@localhost:3306/ClassicModels
10 rows affected.

[(datetime.date(2003, 1, 16), 10223.83),
 (datetime.date(2003, 1, 28), 10549.01),
 (datetime.date(2003, 1, 30), 5494.78),
 (datetime.date(2003, 2, 16), 50218.95),
 (datetime.date(2003, 2, 20), 53959.21),
 (datetime.date(2003, 2, 25), 40206.2),
 (datetime.date(2003, 3, 2), 52151.81),
 (datetime.date(2003, 3, 9), 51001.22),
 (datetime.date(2003, 3, 12), 22292.62),
 (datetime.date(2003, 3, 20), 25833.14)]

4. Report the products that have not been sold.

In [140]:
%%sql

SELECT productName
    FROM products LEFT JOIN orderdetails
    ON products.productCode=orderdetails.productCode
    WHERE orderdetails.orderNumber is Null;

 * mysql+pymysql://root:***@localhost:3306/ClassicModels
1 rows affected.

[('1985 Toyota Supra',)]

5. List the amount paid by each customer.

In [147]:
%%sql

SELECT customerName, ROUND(SUM(payments.amount), 2) as totalPayments
    FROM customers JOIN payments
    ON customers.customerNumber=payments.customerNumber
    GROUP BY customerName
    ORDER BY totalPayments DESC
    LIMIT 10;

 * mysql+pymysql://root:***@localhost:3306/ClassicModels
10 rows affected.

[('Euro+ Shopping Channel', 715738.98),
 ('Mini Gifts Distributors Ltd.', 584188.24),
 ('Australian Collectors, Co.', 180585.07),
 ('Muscle Machine Inc', 177913.95),
 ('Dragon Souveniers, Ltd.', 156251.03),
 ('Down Under Souveniers, Inc', 154622.08),
 ('AV Stores, Co.', 148410.09),
 ("Anna's Decorations, Ltd", 137034.22),
 ('Corporate Gift Ideas Co.', 132340.78),
 ('Saveley & Henriot, Co.', 130305.35)]

6. How many orders have been placed by Herkku Gifts?

In [149]:
%%sql
SELECT customerName, COUNT(orders.orderNumber) as numberOfOrders
    FROM customers JOIN orders
    ON customers.customerNumber=orders.customerNumber
    WHERE customerName="Herkku Gifts";

 * mysql+pymysql://root:***@localhost:3306/ClassicModels
1 rows affected.

[('Herkku Gifts', 3)]

7. Who are the employees in Boston?

In [152]:
%%sql

SELECT CONCAT(firstName, " ", lastName) as employeeName, offices.city
    FROM employees JOIN offices
    ON employees.officeCode=offices.officeCode
    WHERE offices.city="Boston";

 * mysql+pymysql://root:***@localhost:3306/ClassicModels
2 rows affected.

[('Julie Firrelli', 'Boston'), ('Steve Patterson', 'Boston')]